XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31L12x_Series.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ABOV</vendor>
  <name>A31L12x_Series</name>
  <description>ABOV Semiconductor CM0+ Device Support, Drivers and Examples</description>
  <url>https://www.abov.co.kr/data/mds/PACK/</url>
  <supportContact>abov_fae@abov.co.kr</supportContact>

  <releases>
    <release version="1.4.0" date="2021-06-28">
      *  Updated version rule
      *  Updated Keil Pack File Name :  ABOV.A31L1xx_DFP  ==> ABOV.A31L12x_Series
      *  Fixed HAL_GPIO_ConfigOutput()
      *  Fixed I2Cn_Mwait():   I2Cx ->ST ==> tmp
    </release>
    <release version="1.3.0" date="2021-05-13">
      *  Updated version rule
      *  Fixed HAL_PWR_EnterSleepMode()
      *  Fixed HAL_PWR_EnterPowerDownMode()
      *  Fixed Driver:   SCUCG_StopMonClk()  ==> HAL_SCU_ClockMonitoring_Disable()
      *  Fixed HAL_SCU_SetWakupData()
      *  Renamed SPIn_Init() to HAL_SPIn_Init()
      *  Removed XTFLSR register
      *  Fixed HAL_SCU_MainXtal_PinConfig()
      *  Fixed HAL_SCU_SubXtal_PinConfig ()
    </release>
    <release version="1.2.0" date="2020-07-27">
      *  Changed @author:   "ABOV M team" ==> "ABOV Application Team"
      *  Fixed HAL_UART_Transmit():   UART1 ==> UARTx
      *  Added the registers for Configuration Option Area Page 0 in svd file
      *  Added device:   A31L122
    </release>
    <release version="1.1.0" date="2020-05-29">
      *  Added folder:   Core/CMSIS/Include
      *  Added folder:   SFR
      *  Changed folder structure:   Device ---> Core/Device
      *  Changed folder name:   Documentation --> Doc
      *  Deleted file:   slib.c
      *  Deleted file:   slib.h
      *  Added file:   Drivers/Include/A31L12x_hal_libcfg.h
      *  Added file:   Examples/.../A31L12x_it.*
      *  Added file:   Examples/.../A31L12x_PortInit.c
      *  Added file:   Examples/.../A31L12x_SystemClock.c
      *  Added file:   Examples/.../main_conf.h
      *  Merged file:   A31L12x_SCUCC.* + A31L12x_SCUCG.* ==> A31L12x_SCU.*
      *  Changed file name:   Driver/*.*
      *  Changed file:   Device/
      *  Changed file:   Drivers/
      *  Changed file:   Examples/
    </release>
    <release version="1.0.0" date="2019-11-01">
      Initial Version
      Fixed I2Cn_Init() I2Cn_DeInit()
      Fixed USART1n_DataControlConfig()
      Fixed SCUCC_GetRstSrc()
      Renamed PMU_Test to PMU_AllPowerOff
      Updated PMU_AllPowerOff Example
      Added PMU_SRAMRetentionPower Example
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>ABOV</keyword>
    <keyword>A31L</keyword>
  </keywords>

  <devices>
    <family Dfamily="A31L12xSeries" Dvendor="ABOV Semiconductor:126">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" />
      <description>
        The ABOV A31L series device family contains an ARM Cortex-M0+ processor with a versatile set of on-chip peripherals
      </description>
      <!-- Subfamily : A31L12x *********************************************************-->
      <subFamily DsubFamily="A31L12x">
        <processor Dclock="32000000" />
        <compile header="A31L12x/Core/Device/ABOV/A31L12x/Include/A31L12x.h" />
        <debug svd="A31L12x/SVD/A31L12x.svd" />
        <algorithm name="A31L12x\FlashLoader\KEIL\A31L12x_FLASH.FLM" start="0x00000000" size="0x10000" default="1" />
        <algorithm name="A31L12x\FlashLoader\KEIL\A31L12x_CFG.FLM" start="0x1FFFF200" size="0x600" default="1" />
        <feature type="VCC" n="1.65" m="3.6" />
        <feature type="Temp" n="-40" m="105" />
        <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1" />
        <feature type="WDT" n="1" m="40" name="Watchdog Timer" />
        <!-- Device : A31L123 -->
        <device Dname="A31L123">
          <description>Package type 64,48,32LQFP,32QFN</description>
          <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1" />
        </device>
        <!-- Device : A31L122 -->
        <device Dname="A31L122">
          <description>Package type 64,48,32LQFP,32QFN</description>
          <memory id="IROM1" start="0x00000000" size="0x8000" startup="1" default="1" />
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- condition : A31L12x *********************************************************-->
    <condition id="A31L12x CMSIS">
      <description>A31L12x device and CMSIS-Core</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31L123" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31L122" />
    </condition>
  </conditions>

  <components>
    <!-- component : A31L12x *********************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>System Startup for ABOV A31L12x devices</description>
      <files>
        <file category="include" name="A31L12x/Core/Device/ABOV/A31L12x/Include/" />
        <file category="include" name="A31L12x/Drivers/Include/" />
        <file category="header" version="1.0.0" name="A31L12x/Core/Device/ABOV/A31L12x/Include/A31L12x.h" attr="config" />
        <file category="header" version="1.0.0" name="A31L12x/Core/Device/ABOV/A31L12x/Include/system_A31L12x.h" attr="config" />
        <file category="source" version="1.0.0" name="A31L12x/Core/Device/ABOV/A31L12x/Source/ARM/startup_A31L12x.s" attr="config" />
        <file category="source" version="1.0.0" name="A31L12x/Core/Device/ABOV/A31L12x/Source/system_A31L12x.c" attr="config" />
        <file category="source" version="1.0.0" name="A31L12x/Option/KEIL/option_A31L12x.s" attr="config" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Debug_FrameWork" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x Debug Framework</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_aa_types.h" />
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_libcfg.h" />
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_wtidky.h" />
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_debug_frmwrk.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_debug_frmwrk.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x ADC Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_adc.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_adc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="CMPn" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x CMPn Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_cmpn.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_cmpn.c" />
      </files>
    </component>
