XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31L12x_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="CRC" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x CRC Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_crc.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_crc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="DMACn" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x DMACn Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_dmacn.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_dmacn.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="FMC" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x FMC Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_fmc.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_fmc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="I2Cn" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x I2Cn Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_i2cn.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_i2cn.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="INTC" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x Interrupt Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_intc.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_intc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="LCD" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x LCD Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_lcd.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_lcd.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="LPUART" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x LPUART Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_lpuart.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_lpuart.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PCU" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x PCU Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_pcu.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_pcu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PMU" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x PMU Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_pmu.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_pmu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PWR" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x PWR Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_pwr.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_pwr.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="RTCC" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x RTCC Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_rtcc.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_rtcc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SCn" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x SCn Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_scn.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_scn.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SCU" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x SCUCC/SCUCG Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_scu.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_scu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SCULV" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x SCULV Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_sculv.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_sculv.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SPIn" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x SPIn Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_spin.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_spin.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="TIMER5n" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x TIMER5n Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_timer5n.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_timer5n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="TIMER4n" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x TIMER4n Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_timer4n.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_timer4n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="UARTn" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x UARTn Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_uartn.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_uartn.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="USART1n" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x USART1n Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_usart1n.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_usart1n.c" />
      </files>
    </component>
