XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31L12x_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="WDT" Cversion="1.0.0" condition="A31L12x CMSIS">
      <description>A31L12x WDT Control</description>
      <files>
        <file category="header" name="A31L12x/Drivers/Include/A31L12x_hal_wdt.h" />
        <file category="source" name="A31L12x/Drivers/Source/A31L12x_hal_wdt.c" />
      </files>
    </component>
  </components>

  <boards>
    <!-- board : A31L12x *********************************************************-->
    <board vendor="ABOV" name="STK-A31L123RLN-A" revision="V1.1">
      <description>ABOV STK-A31L123RLN-A STARTER KIT V1.1</description>
      <mountedDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A31L123" />
      <feature type="XTAL" n="16000000" />
      <feature type="PWR" n="5" name="USB Powered" />
      <feature type="PWR" n="3.3" m="5" name="External Supply" />
      <feature type="Button" n="2" name="Push-buttons: User and Reset" />
      <feature type="LED" n="6" name="LEDs: Power, Two user" />
    </board>
  </boards>

  <examples>
    <!-- Example : A31L12x *********************************************************-->
    <example name="ABOV ADC_ContinuousMode" doc="Abstract.txt" folder="A31L12x/Examples/ADC/ADC_ContinuousMode">
      <description>ADC_ContinuousMode Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/ADC_ContinuousMode.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC_SequentialMode" doc="Abstract.txt" folder="A31L12x/Examples/ADC/ADC_SequentialMode">
      <description>ADC_SequentialMode Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/ADC_SequentialMode.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC_SingleMode_Interrupt" doc="Abstract.txt" folder="A31L12x/Examples/ADC/ADC_SingleMode_Interrupt">
      <description>ADC_SingleMode_Interrupt Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/ADC_SingleMode_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC_SingleMode_Polling" doc="Abstract.txt" folder="A31L12x/Examples/ADC/ADC_SingleMode_Polling">
      <description>ADC_SingleMode_Polling Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/ADC_SingleMode_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CMPn_Test" doc="Abstract.txt" folder="A31L12x/Examples/CMPn/CMPn_Test">
      <description>CMPn_Test Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/CMPn_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC_Checksum" doc="Abstract.txt" folder="A31L12x/Examples/CRC/CRC_Checksum">
      <description>CRC_Checksum Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/CRC_Checksum.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC_CRC8" doc="Abstract.txt" folder="A31L12x/Examples/CRC/CRC_CRC8">
      <description>CRC_CRC8 Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/CRC_CRC8.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC_CRC16" doc="Abstract.txt" folder="A31L12x/Examples/CRC/CRC_CRC16">
      <description>CRC_CRC16 Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/CRC_CRC16.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC_CRC16_CCITT" doc="Abstract.txt" folder="A31L12x/Examples/CRC/CRC_CRC16_CCITT">
      <description>CRC_CRC16_CCITT Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/CRC_CRC16_CCITT.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC_CRC32" doc="Abstract.txt" folder="A31L12x/Examples/CRC/CRC_CRC32">
      <description>CRC_CRC32 Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/CRC_CRC32.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DMACn_ADC" doc="Abstract.txt" folder="A31L12x/Examples/DMACn/DMACn_ADC">
      <description>DMACn_ADC Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/DMACn_ADC.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DMACn_I2Cn" doc="Abstract.txt" folder="A31L12x/Examples/DMACn/DMACn_I2Cn">
      <description>DMACn_I2Cn Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/DMACn_I2Cn.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DMACn_LPUART" doc="Abstract.txt" folder="A31L12x/Examples/DMACn/DMACn_LPUART">
      <description>DMACn_LPUART Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/DMACn_LPUART.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DMACn_SCn_SCI" doc="Abstract.txt" folder="A31L12x/Examples/DMACn/DMACn_SCn_SCI">
      <description>DMACn_SCn_SCI Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/DMACn_SCn_SCI.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DMACn_SCn_UART" doc="Abstract.txt" folder="A31L12x/Examples/DMACn/DMACn_SCn_UART">
      <description>DMACn_SCn_UART Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/DMACn_SCn_UART.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DMACn_SPIn" doc="Abstract.txt" folder="A31L12x/Examples/DMACn/DMACn_SPIn">
      <description>DMACn_SPIn Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/DMACn_SPIn.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DMACn_UARTn" doc="Abstract.txt" folder="A31L12x/Examples/DMACn/DMACn_UARTn">
      <description>DMACn_UARTn Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/DMACn_UARTn.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DMACn_USART1n_UART" doc="Abstract.txt" folder="A31L12x/Examples/DMACn/DMACn_USART1n_UART">
      <description>DMACn_USART1n_UART Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/DMACn_USART1n_UART.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FMC_Flash" doc="Abstract.txt" folder="A31L12x/Examples/FMC/FMC_Flash">
      <description>FMC_Flash Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/FMC_Flash.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO_EINT" doc="Abstract.txt" folder="A31L12x/Examples/GPIO/GPIO_EINT">
      <description>GPIO_EINT Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/GPIO_EINT.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO_Input" doc="Abstract.txt" folder="A31L12x/Examples/GPIO/GPIO_Input">
      <description>GPIO_Input Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/GPIO_Input.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO_LedBlinky" doc="Abstract.txt" folder="A31L12x/Examples/GPIO/GPIO_LEDBlinky">
      <description>GPIO_LedBlinky Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/GPIO_LEDBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV I2Cn_MasterSlave" doc="Abstract.txt" folder="A31L12x/Examples/I2Cn/I2Cn_MasterSlave">
      <description>I2Cn_MasterSlave Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/I2Cn_MasterSlave.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV LCD_Test" doc="Abstract.txt" folder="A31L12x/Examples/LCD/LCD_Test">
      <description>LCD_Test Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/LCD_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV LPUART_Interrupt" doc="Abstract.txt" folder="A31L12x/Examples/LPUART/LPUART_Interrupt">
      <description>LPUART_Interrupt Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/LPUART_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV LPUART_Polling" doc="Abstract.txt" folder="A31L12x/Examples/LPUART/LPUART_Polling">
      <description>LPUART_Polling Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/LPUART_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PMU_AllPowerOff" doc="Abstract.txt" folder="A31L12x/Examples/PMU/PMU_AllPowerOff">
      <description>PMU_AllPowerOff Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/PMU_AllPowerOff.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PMU_SRAMRetentionPower" doc="Abstract.txt" folder="A31L12x/Examples/PMU/PMU_SRAMRetentionPower">
      <description>PMU_SRAMRetentionPower Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/PMU_SRAMRetentionPower.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR_DeepSleep" doc="Abstract.txt" folder="A31L12x/Examples/PWR/PWR_DeepSleep">
      <description>PWR_DeepSleep Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/PWR_DeepSleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR_LVI_Interrupt" doc="Abstract.txt" folder="A31L12x/Examples/PWR/PWR_LVI_Interrupt">
      <description>PWR_LVI_Interrupt Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/PWR_LVI_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR_LVI_Polling" doc="Abstract.txt" folder="A31L12x/Examples/PWR/PWR_LVI_Polling">
      <description>PWR_LVI_Polling Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/PWR_LVI_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR_Sleep" doc="Abstract.txt" folder="A31L12x/Examples/PWR/PWR_Sleep">
      <description>PWR_Sleep Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/PWR_Sleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV RTCC_Test" doc="Abstract.txt" folder="A31L12x/Examples/RTCC/RTCC_Test">
      <description>RTCC_Test Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/RTCC_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SCn_SCI_Interrupt" doc="Abstract.txt" folder="A31L12x/Examples/SCn/SCn_SCI_Interrupt">
      <description>SCn_SCI_Interrupt Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/SCn_SCI_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SCn_SCI_Polling" doc="Abstract.txt" folder="A31L12x/Examples/SCn/SCn_SCI_Polling">
      <description>SCn_SCI_Polling Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/SCn_SCI_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SCn_UART_Interrupt" doc="Abstract.txt" folder="A31L12x/Examples/SCn/SCn_UART_Interrupt">
      <description>SCn_UART_Interrupt Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/SCn_UART_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SCn_UART_Polling" doc="Abstract.txt" folder="A31L12x/Examples/SCn/SCn_UART_Polling">
      <description>SCn_UART_Polling Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/SCn_UART_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPIn_Interrupt" doc="Abstract.txt" folder="A31L12x/Examples/SPIn/SPIn_Interrupt">
      <description>SPIn_Interrupt Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/SPIn_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPIn_Polling" doc="Abstract.txt" folder="A31L12x/Examples/SPIn/SPIn_Polling">
      <description>SPIn_Polling Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/SPIn_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER4n_BackToBack" doc="Abstract.txt" folder="A31L12x/Examples/TIMER4n/TIMER4n_BackToBack">
      <description>TIMER4n_BackToBack Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER4n_BackToBack.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER4n_Capture" doc="Abstract.txt" folder="A31L12x/Examples/TIMER4n/TIMER4n_Capture">
      <description>TIMER4n_Capture Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER4n_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER4n_CounterSharing" doc="Abstract.txt" folder="A31L12x/Examples/TIMER4n/TIMER4n_CounterSharing">
      <description>TIMER4n_CounterSharing Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER4n_CounterSharing.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER4n_OneShot" doc="Abstract.txt" folder="A31L12x/Examples/TIMER4n/TIMER4n_OneShot">
      <description>TIMER4n_OneShot Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER4n_OneShot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
