XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31L12x_Series.pdsc
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER4n_PeriodMatchInterrupt" doc="Abstract.txt" folder="A31L12x/Examples/TIMER4n/TIMER4n_PeriodMatchInterrupt">
      <description>TIMER4n_PeriodMatchInterrupt Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER4n_PeriodMatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER4n_PeriodMatchPolling" doc="Abstract.txt" folder="A31L12x/Examples/TIMER4n/TIMER4n_PeriodMatchPolling">
      <description>TIMER4n_PeriodMatchPolling Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER4n_PeriodMatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER5n_Capture" doc="Abstract.txt" folder="A31L12x/Examples/TIMER5n/TIMER5n_Capture">
      <description>TIMER5n_Capture Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER5n_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER5n_MatchInterrupt" doc="Abstract.txt" folder="A31L12x/Examples/TIMER5n/TIMER5n_MatchInterrupt">
      <description>TIMER5n_MatchInterrupt Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER5n_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER5n_MatchPolling" doc="Abstract.txt" folder="A31L12x/Examples/TIMER5n/TIMER5n_MatchPolling">
      <description>TIMER5n_MatchPolling Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER5n_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER5n_OneShot" doc="Abstract.txt" folder="A31L12x/Examples/TIMER5n/TIMER5n_OneShot">
      <description>TIMER5n_OneShot Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER5n_OneShot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER5n_PWM" doc="Abstract.txt" folder="A31L12x/Examples/TIMER5n/TIMER5n_PWM">
      <description>TIMER5n_PWM Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER5n_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UARTn_Interrupt" doc="Abstract.txt" folder="A31L12x/Examples/UARTn/UARTn_Interrupt">
      <description>UARTn_Interrupt Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/UARTn_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UARTn_Polling" doc="Abstract.txt" folder="A31L12x/Examples/UARTn/UARTn_Polling">
      <description>UARTn_Polling Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/UARTn_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART1n_SPI_Interrupt" doc="Abstract.txt" folder="A31L12x/Examples/USART1n/USART1n_SPI_Interrupt">
      <description>USART1n_SPI_Interrupt Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/USART1n_SPI_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART1n_SPI_Polling" doc="Abstract.txt" folder="A31L12x/Examples/USART1n/USART1n_SPI_Polling">
      <description>USART1n_SPI_Polling Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/USART1n_SPI_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART1n_UART_Interrupt" doc="Abstract.txt" folder="A31L12x/Examples/USART1n/USART1n_UART_Interrupt">
      <description>USART1n_UART_Interrupt Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/USART1n_UART_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART1n_UART_Polling" doc="Abstract.txt" folder="A31L12x/Examples/USART1n/USART1n_UART_Polling">
      <description>USART1n_UART_Polling Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/USART1n_UART_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART1n_USRT_Interrupt" doc="Abstract.txt" folder="A31L12x/Examples/USART1n/USART1n_USRT_Interrupt">
      <description>USART1n_USRT_Interrupt Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/USART1n_USRT_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART1n_USRT_Polling" doc="Abstract.txt" folder="A31L12x/Examples/USART1n/USART1n_USRT_Polling">
      <description>USART1n_USRT_Polling Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/USART1n_USRT_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT_Interrupt" doc="Abstract.txt" folder="A31L12x/Examples/WDT/WDT_Interrupt">
      <description>WDT_Interrupt Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/WDT_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT_Polling" doc="Abstract.txt" folder="A31L12x/Examples/WDT/WDT_Polling">
      <description>WDT_Polling Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/WDT_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT_Reset" doc="Abstract.txt" folder="A31L12x/Examples/WDT/WDT_Reset">
      <description>WDT_Reset Example (A31L123)</description>
      <board name="STK-A31L123RLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/WDT_Reset.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>
</package>
